event_scheduler/app/controllers/events_controller.rb

	def create

		u=User.find(current_user).events << Event.new(event_params)

		@par=Participent.new
		if params["user_ids"].present?
		 params["user_ids"].map {|i| i.to_i}.each do |i|
		 @par.user=User.find(i)
		 @par.event=Event.last
		 @par.save
---
SELECT  "events".* FROM "events"  ORDER BY "events"."id" DESC LIMIT 1
INSERT INTO "participents" ("event_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["event_id", 1], ["user_id", 3], ["created_at", "2016-11-15 04:30:21.258102"], ["updated_at", "2016-11-15 04:30:21.258102"]]