event_scheduler/app/controllers/events_controller.rb

SELECT "users".* FROM "users"
---
	def new
		# binding.pry
		@users=User.all

SELECT "events".* FROM "events"
SELECT "users".* FROM "users"
---
	def index
		# binding.pry
		@events=Event.all
		@users=User.all

INSERT INTO "events" ("title", "venue", "desc", "owner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", ""], ["venue", ""], ["desc", ""], ["owner_id", 1], ["created_at", "2016-11-15 12:22:20.423916"], ["updated_at", "2016-11-15 12:22:20.423916"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
---
	def create
		# binding.pry
		User.find(current_user).events << Event.new(event_params)

SELECT "users".* FROM "users"
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 1]]
---
	def edit
		@users=User.all
		@event=Event.find(params["event_id"])

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "events" SET "status" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["status", "f"], ["updated_at", "2016-11-16 06:16:30.315488"], ["id", 2]]
SELECT "users".* FROM "users" INNER JOIN "participents" ON "users"."id" = "participents"."user_id" WHERE "participents"."event_id" = $1  [["event_id", 3]]
---
	def update
		# binding.pry
		@event=Event.find(params["event_id"])
		@event.update(event_params)

		@event.users.clear

		if (params["user_ids"])
			@event.users << User.find(params["user_ids"])