event_scheduler/app/controllers/users_controller.rb

	def create

		@user=User.new(user_params)
		if @user.save
---
INSERT INTO "users" ("firstname", "lastname", "username", "email", "phone", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"