event_scheduler/app/views/events/edit.html.erb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 1]]
---

<% if current_user.id == Event.find(params["event_id"]).owner_id%>

SELECT "users".id FROM "users" INNER JOIN "participents" ON "users"."id" = "participents"."user_id" WHERE "participents"."event_id" = $1  [["event_id", 1]]
---
  <%if !(t.id==current_user.id)%>
  <%= check_box_tag "user_ids[]", t.id , @event.user_ids.include?(t.id)   %>