event_scheduler/app/views/events/index.html.erb

	<strong>Event : </strong><%= link_to e.title.capitalize, edit_event_path(e) %><br>
	<strong>Organiser : </strong>	<%= User.find(e.owner_id).firstname%>&nbsp;<%= User.find(e.owner_id).lastname%><br>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

          <tr>  <th>List of Participants</th></tr>
          	<% e.users.each do |u| %>
---
SELECT "users".* FROM "users" INNER JOIN "participents" ON "users"."id" = "participents"."user_id" WHERE "participents"."event_id" = $1  [["event_id", 1]]