event_scheduler/app/views/partials/_navbar.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
      <li>
  <%= link_to User.find(current_user.id).firstname.upcase+" "+User.find(current_user.id).lastname.upcase,show_user_path(current_user) %></li>